app/controllers/users_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at") VALUES ('agurquieta@gmail.com', '$2a$12$LMh7nvyNKBqSpyvBfifZLeQUvxQGO19Xo6P7Vhe28NulHMGhn.4O6', '2025-03-22 07:04:52.155387', '2025-03-22 07:04:52.155387') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save